Конфигурация/Documents/РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РешенияКлиентовПоЗначениямЭСП</xr:Item>
				<xr:Item>InformationRegister.АналогиЦенныхБумаг</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭСП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭффективнаяПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЦелиИспользованияАналогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиУчетаЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройки</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НастройкиУчетаЦенныхБумаг</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/РаспределенияАктивовЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РаспределенияАктивовЕПС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сделки</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/ДенежныеПотокиПоОблигациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДенежныеПотокиПоОблигациям</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Облигации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаПотока</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поток</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Купон</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Documents/РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область События_формы_и_элементов

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
	Если Объект.Ссылка = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПустаяСсылка()
		И ЭтотОбъект.Параметры.Свойство("ЦеннаяБумага")
		И ЭтотОбъект.Параметры.Свойство("Клиент")
		И ЭтотОбъект.Параметры.Свойство("Организация") Тогда
		
		Если ПараметрыСеанса.ТекущаяОрганизация <> ЭтотОбъект.Параметры.Организация Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Зайдите под другой организацией");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект, ЭтотОбъект.Параметры, "ЦеннаяБумага, Клиент, Организация");
		Объект.Дата = ТекущаяДата();
		
		ЗаполнитьЭСППриПоявленииДосрочнойОфертыНаСервере();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	ЗаменяемыеДанные			= Новый Массив;
	ЗаполненаДатаНачалаДействия = ЗначениеЗаполнено(Объект.ДатаНачалаДействия);
	ЗаполненыАналоги			= (Объект.Аналоги.Количество() > 0);
	
	Если ЗаполненаДатаНачалаДействия Тогда
		ЗаменяемыеДанные.Добавить("дату начала действия сведений");	
	Иначе
		Объект.ДатаНачалаДействия = Объект.Дата;
	КонецЕсли;
	
	Если ЗаполненыАналоги Тогда
		ЗаменяемыеДанные.Добавить("даты окончания действия аналогов");
	КонецЕсли;
	
	Если ЗаполненаДатаНачалаДействия ИЛИ ЗаполненыАналоги Тогда
		
		РезультатВопроса = Вопрос("Заменить " + СтрСоединить(ЗаменяемыеДанные, " и ") + " на " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + "?", РежимДиалогаВопрос.ДаНет);
		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			
			Если ЗаполненаДатаНачалаДействия Тогда
				Объект.ДатаНачалаДействия = Объект.Дата;
			КонецЕсли;			
			
			Если ЗаполненыАналоги Тогда
				УстановитьДатуОкончанияДействияАналогов(Объект.Аналоги, Объект.Дата);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФорма.СписокВозможныхУчетныхАктивовЕПС.Очистить();
	Если ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаНастройки Тогда
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаДействияПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия)
		И Объект.Аналоги.Количество() > 0
	Тогда
		 
		РезультатВопроса = Вопрос("Заменить даты окончания действия аналогов на " + Формат(Объект.ДатаНачалаДействия, "ДФ=dd.MM.yyyy") + "?", РежимДиалогаВопрос.ДаНет);
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УстановитьДатуОкончанияДействияАналогов(Объект.Аналоги, Объект.ДатаНачалаДействия);   	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Объект.ЭСП.Очистить();
	ЭтаФорма.СписокВозможныхУчетныхАктивовЕПС.Очистить();
	
	Если ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаНастройки Тогда
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	
	Объект.ЭСП.Очистить();
	Объект.Аналоги.Очистить();
	Объект.НастройкиУчета.Очистить();
	ЭтаФорма.СписокВозможныхУчетныхАктивовЕПС.Очистить();
	
	Если ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаНастройки Тогда
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭСППередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Не ДоступноИзменениеСведенийПоЦеннойБумаге(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭСПИспользуетсяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭСП.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ТекущиеДанные.Используется Тогда
		ТекущиеДанные.ЭСП = 0;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АналогиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Не ДоступноИзменениеСведенийПоЦеннойБумаге(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АналогиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.Аналоги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НоваяСтрока И Не Копирование Тогда
		ТекущиеДанные.ДатаОкончанияДействия = Объект.ДатаНачалаДействия;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АналогиДатаОкончанияДействияПриИзменении(Элемент)

	ВыделенныеСтроки = Элементы.Аналоги.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		УстановитьДатуОкончанияДействияАналогов(ВыделенныеСтроки, Элементы.Аналоги.ТекущиеДанные.ДатаОкончанияДействия); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АналогиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;	
	
	ВыбранныеЗначения = РаботаСКоллекциями.ЗначениеВМассив(ВыбранноеЗначение);
	
	Для Каждого Аналог Из ВыбранныеЗначения Цикл
		Если Объект.Аналоги.НайтиСтроки(Новый Структура("ЦеннаяБумага", Аналог)).Количество() = 0 Тогда
			НовыйАналог = Объект.Аналоги.Добавить();
			НовыйАналог.ЦеннаяБумага		  = Аналог;
			НовыйАналог.ДатаОкончанияДействия = Объект.ДатаНачалаДействия;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АналогиНазначениеПриИзменении(Элемент)

	НазначениеАналога = Элементы.Аналоги.ТекущиеДанные.Назначение;
	
	Для Каждого ИдентификаторСтроки Из Элементы.Аналоги.ВыделенныеСтроки Цикл
		Элементы.Аналоги.ДанныеСтроки(ИдентификаторСтроки).Назначение = НазначениеАналога;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СостояниеДокументаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	РаботаСФормамиКлиент.СостояниеДокументаОбработкаНавигационнойСсылки(ЭтаФорма, Объект.Ссылка, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗаполнитьЭСП(Команда)

	Если Не ДоступноИзменениеСведенийПоЦеннойБумаге() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ОткрытьФормуМодально("Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Форма.ФормаВводаЭСП");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЭСП(ДанныеЗаполнения.ИспользоватьЭСП, ДанныеЗаполнения.ЭСП, ДанныеЗаполнения.ПартииЗаДату);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодборАналогов(Команда)

	Если Не ДоступноИзменениеСведенийПоЦеннойБумаге() Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеАналоги = Новый Массив;
	Для Каждого СтрокаАналога Из Объект.Аналоги Цикл
		Если ЗначениеЗаполнено(СтрокаАналога.ЦеннаяБумага) Тогда
			ВыбранныеАналоги.Добавить(СтрокаАналога.ЦеннаяБумага);	
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора = Новый Структура("ЦеннаяБумага, Период, Клиент, Организация, ВыбранныеАналоги, РассчитыватьДюрациюПриОтсутствииДанныхММВБ", 
		Объект.ЦеннаяБумага, Объект.ДатаНачалаДействия, Объект.Клиент, Объект.Организация, Новый ФиксированныйМассив(ВыбранныеАналоги), Истина);
		
	ПараметрыФормы = Новый Структура("ПараметрыПодбора, ЗакрыватьПриВыборе",
		ПараметрыПодбора, Истина);
		
	ОткрытьФормуМодально("Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Форма.ФормаПодбораАналогов", ПараметрыФормы, ЭтаФорма.Элементы.Аналоги);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьЭСПНаРыночность(Команда)
	
	ДанныеЦенныхБумаг = ЭтаФорма.Элементы.ЭСП.ТекущиеДанные;
	Если ДанныеЦенныхБумаг = Неопределено Или ДанныеЦенныхБумаг.Партия = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите партию!");
		Возврат;
	КонецЕсли;
	
	Отчет = ПроверитьЭСПНаРыночность(ДанныеЦенныхБумаг.НомерСтроки);
	
	Если Отчет <> Неопределено Тогда
		Отчет.Показать("Проверка ЭСП");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ЗаполнитьСписокВозможныхУчетныхАктивовЕПС()
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат; 
	КонецЕсли;
	
	НастройкиУчетныйАктивЕПСУстановитьРежимВыбораИзСписка(ЭтаФорма);
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() <> 0 Тогда
		Возврат;  // не будем повторно заполнять
	КонецЕсли;


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Клиент = &Клиент) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ)
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаспределенияАктивовЕПС.УчетныйАктивЕПС
		|ИЗ
		|	РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДУ КАК _СчетаДУ
		|		ПО (ВЫРАЗИТЬ(РаспределенияАктивовЕПС.Сделка КАК Документ.Сделка).СчетДоверительногоУправления = _СчетаДУ.СчетДоверительногоУправления)
		|			И (РаспределенияАктивовЕПС.Организация = &Организация
		|				И РаспределенияАктивовЕПС.ЦеннаяБумага = &ЦеннаяБумага)";
	
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Объект.ЦеннаяБумага);
	
	СписокВозможныхУчетныхАктивовЕПС.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчетныйАктивЕПС"));
	
	Если СписокВозможныхУчетныхАктивовЕПС.Количество() = 0 Тогда
		СписокВозможныхУчетныхАктивовЕПС.Добавить(БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(Объект.Дата, Перечисления.РынкиЦенныхБумаг.Облигации, Объект.ЦеннаяБумага));
	КонецЕсли;
	
	ЭтаФорма.Элементы.НастройкиУчетныйАктивЕПС.СписокВыбора.ЗагрузитьЗначения(СписокВозможныхУчетныхАктивовЕПС.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если Объект.ЭСП.Количество() > 0 Тогда
		
		#Область Заполняем_сведения_о_счетах_ДУ_и_количестве_бумаг_на_остатках
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Партии.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	Партии.ЭСП КАК ЭСП,
			|	Партии.Используется КАК Используется,
			|	Партии.Партия КАК Партия,
			|	Партии.СтрокаПартии КАК СтрокаПартии
			|ПОМЕСТИТЬ _Партии
			|ИЗ
			|	&Партии КАК Партии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Партии.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	_Партии.ЭСП КАК ЭСП,
			|	_Партии.Используется КАК Используется,
			|	_Партии.Партия КАК Партия,
			|	_Партии.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество
			|ИЗ
			|	_Партии КАК _Партии
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
			|				&Период,
			|				Организация = &Организация
			|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|					И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки
			|		ПО _Партии.Партия = БухПартииЦенныхБумагОстатки.Партия
			|			И _Партии.СтрокаПартии = БухПартииЦенныхБумагОстатки.СтрокаПартии");
		
		Запрос.УстановитьПараметр("Организация",	Объект.Организация);
		Запрос.УстановитьПараметр("Период",			КонецДня(Объект.Дата));
		Запрос.УстановитьПараметр("Партии",			Объект.ЭСП.Выгрузить());
		Запрос.УстановитьПараметр("ЦеннаяБумага",	Объект.ЦеннаяБумага);
		
		Объект.ЭСП.Загрузить(Запрос.Выполнить().Выгрузить());
		
		#КонецОбласти
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ДоступноИзменениеСведенийПоЦеннойБумаге(Отказ = Ложь)
	
	ПроверкаПройдена = Истина;
	
	Если Не ЗначениеЗаполнено(Объект.ЦеннаяБумага) Тогда
		
		ПроверкаПройдена = Ложь;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед изменением сведений необходимо указать ценную бумагу", , , "Объект.ЦеннаяБумага", Отказ);
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ДатаНачалаДействия) Тогда
		
		ПроверкаПройдена = Ложь;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед изменением сведений необходимо указать дату начала действия", , , "Объект.ДатаНачалаДействия", Отказ);
		
	КонецЕсли;

	Возврат ПроверкаПройдена;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЭСП(Используется, ЭСП, Дата)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	&ЭСП КАК ЭСП,
		|	&Используется КАК Используется,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетДоверительногоУправления)
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага
		|				И (&Дата = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ НАЧАЛОПЕРИОДА(Партия.Дата, ДЕНЬ) = &Дата)) КАК БухПартииЦенныхБумагОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии");
	
	СчетаДоверительногоУправленияКлиента =
		РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(Объект.Клиент, Объект.Организация, Объект.Дата);

	Запрос.УстановитьПараметр("Организация",					Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетаДоверительногоУправленияКлиента);
	Запрос.УстановитьПараметр("Период",							КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Рынок",							РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(Объект.ЦеннаяБумага));
	Запрос.УстановитьПараметр("ЦеннаяБумага",					Объект.ЦеннаяБумага);
	Запрос.УстановитьПараметр("Используется",					Используется);
	Запрос.УстановитьПараметр("Дата",							Дата);
	
	Если ЭСП = Неопределено Тогда // нужно заполнить расчетной ЭСП
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЭСП КАК ЭСП,", "");
	Иначе	
		Запрос.УстановитьПараметр("ЭСП",						ЭСП);
	КонецЕсли;

	Объект.ЭСП.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ЭСП = Неопределено Тогда // считаем ЭСП

		Точность = Неопределено;
		Если БухгалтерскийУчетЕПС.ЭтоКлиентГруппыБудущее(Объект.Клиент, Объект.Дата) Тогда
		    Точность = 0.0000000001;
		КонецЕсли;
		
		Для каждого СтрокаЭСП Из Объект.ЭСП Цикл
			
			СчетДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаЭСП.Партия, "СчетДоверительногоУправления");
			
			НастройкиУчетаОбщие			= БухгалтерскийУчет.ОпределитьНастройкиУчета(Объект.Дата, Объект.Организация, СчетДоверительногоУправления);
			НастройкиЦелиРасчета		= БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(Объект.Дата, Объект.Организация, СчетДоверительногоУправления, Справочники.ЦелиРасчета.ЕдиныйПланСчетов);

			НастройкиУчетаЦеннойБумаги	= БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
				НастройкиУчетаОбщие,
				Объект.ЦеннаяБумага,
				СтрокаЭСП.УчетныйАктивЕПС,
				СтрокаЭСП.Партия,
				СтрокаЭСП.СтрокаПартии);
			
			ДенежныйПоток = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
				Объект.Организация,
				Объект.Клиент,
				Объект.ЦеннаяБумага,
				Объект.Дата,
				Новый Структура("УчитыватьРешенияКлиентовПоПотокам, Партия, СтрокаПартии", Истина, СтрокаЭСП.Партия, СтрокаЭСП.СтрокаПартии),
				СтрокаЭСП.УчетныйАктивЕПС,
				,
				,
				НачалоДня(Объект.Дата),
				СчетДоверительногоУправления);
				
			МассивСтрок = Новый Массив();
			МассивСтрок.Добавить(СтрокаЭСП);
			
			ДанныеЭСП = Объект.ЭСП.Выгрузить(МассивСтрок);
			
			ДанныеЭСП.Колонки.Добавить("ЦеннаяБумага", Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
			Для каждого СтрокаДанныеЭСП Из ДанныеЭСП Цикл
				СтрокаДанныеЭСП.ЦеннаяБумага = Объект.ЦеннаяБумага;
			КонецЦикла;
			
			ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ДанныеЭСП, СчетДоверительногоУправления, НачалоДня(Объект.Дата)).Выгрузить();
			
			Цена = -ДатыИЦеныПокупки[0].ЦенаПокупки - ДатыИЦеныПокупки[0].ЦенаКупона;
				
			НоваяЭСП = БухгалтерскийУчет.РассчитатьДоходностьИДюрациюПоПотоку(ДенежныйПоток, НачалоДня(Объект.Дата), Цена, Точность).Доходность;
			Если НастройкиУчетаЦеннойБумаги.РазрядностьОкругленияЭСП <> 0 Тогда
				НоваяЭСП = Окр(НоваяЭСП, НастройкиУчетаЦеннойБумаги.РазрядностьОкругленияЭСП);
			КонецЕсли;
			СтрокаЭСП.ЭСП = НоваяЭСП;
		
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуОкончанияДействияАналогов(Аналоги, ДатаОкончанияДействия)

	Для Каждого СтрокаАналога Из Аналоги Цикл
		Если ТипЗнч(СтрокаАналога) = Тип("Число") Тогда
			СтрокаАналога = Элементы.Аналоги.ДанныеСтроки(СтрокаАналога);
		КонецЕсли;
		СтрокаАналога.ДатаОкончанияДействия = ДатаОкончанияДействия;		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПроверитьЭСПНаРыночность(НомерСтроки)
	
	СтрокаЭСП = Объект.ЭСП[НомерСтроки - 1];
	
	МассивСтрок = Новый Массив();
	МассивСтрок.Добавить(СтрокаЭСП);
	
	ДанныеЭСП = Объект.ЭСП.Выгрузить(МассивСтрок);
	
	ДанныеЭСП.Колонки.Добавить("ЦеннаяБумага", Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
	Для каждого СтрокаДанныеЭСП Из ДанныеЭСП Цикл
		СтрокаДанныеЭСП.ЦеннаяБумага = Объект.ЦеннаяБумага;
	КонецЦикла;
	
	ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ДанныеЭСП, СтрокаЭСП.СчетДоверительногоУправления, Объект.ДатаНачалаДействия).Выгрузить();
	
	ПараметрыПроверки = РаботаСКоллекциями.ТаблицаЗначений_В_МассивСтруктур(ДатыИЦеныПокупки);
	
	Если ДатыИЦеныПокупки.Количество() > 0 Тогда
		
		Отказ = Ложь;
		Отчет = Новый ТабличныйДокумент;
		
		Если БухгалтерскийУчетЕПС.ПроверитьЭСПНаРыночность(Объект.ЦеннаяБумага, СтрокаЭСП.ЭСП, Объект.ДатаНачалаДействия, СтрокаЭСП.Партия.СчетДоверительногоУправления, Отчет, ПараметрыПроверки[0], Отказ) <> Неопределено Тогда
			Возврат Отчет;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЭСППриПоявленииДосрочнойОфертыНаСервере()
	
	ТаблицаПартий = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПартииПоАСиРегистрациейЭСП(НачалоДня(Объект.Дата), Объект.ЦеннаяБумага, Объект.Организация, Объект.Клиент);
	Если ТаблицаПартий.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не было партий с регистрацией ЭСП!");
		Возврат;
	КонецЕсли;
	
	УчетныйАктивЕПС = ТаблицаПартий.ВыгрузитьКолонку("УчетныйАктивЕПС")[0]; // предполагается, что он может быть только один
	СчетДоверительногоУправления = ТаблицаПартий.ВыгрузитьКолонку("СчетДоверительногоУправления")[0]; // берем 1го - настройки должны быть идентичны
	
	НастройкиУчетаОбщие			= БухгалтерскийУчет.ОпределитьНастройкиУчета(Объект.Дата, Объект.Организация, СчетДоверительногоУправления);
	НастройкиЦелиРасчета		= БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(Объект.Дата, Объект.Организация, СчетДоверительногоУправления, Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	
	Точность = Неопределено;
	Если БухгалтерскийУчетЕПС.ЭтоКлиентГруппыБудущее(Объект.Клиент, Объект.Дата) Тогда
	    Точность = 0.0000000001;
	КонецЕсли;
	
	ПересчетВДеньОферты = (Справочники.Облигации.ОпределитьТипОферты(Объект.ЦеннаяБумага, НачалоДня(Объект.Дата)) <> Неопределено);
	
	Для каждого СтрокаТаблицаПартий Из ТаблицаПартий Цикл

		// -1. определим поток на сегодня, после объявления оферты - тут мы не берем решения
		ДенежныйПотокПослеОбъявленияОферты = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
			Объект.Организация,
			Объект.Клиент,
			Объект.ЦеннаяБумага,
			Объект.Дата,
			Ложь,
			УчетныйАктивЕПС,
			,
			,
			КонецДня(Объект.Дата),
			СтрокаТаблицаПартий.СчетДоверительногоУправления);

		Если ДенежныйПотокПослеОбъявленияОферты.Количество() = 0 Тогда // попробуем теперь с учетом решений клиента
			ДенежныйПотокПослеОбъявленияОферты = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
				Объект.Организация,
				Объект.Клиент,
				Объект.ЦеннаяБумага,
				Объект.Дата,
				Новый Структура("УчитыватьРешенияКлиентовПоПотокам, Партия, СтрокаПартии", Истина, СтрокаТаблицаПартий.Партия, СтрокаТаблицаПартий.СтрокаПартии),
				УчетныйАктивЕПС,
				,
				,
				НачалоДня(Объект.Дата),
				СтрокаТаблицаПартий.СчетДоверительногоУправления);
			КонецЕсли;
			
		Если ДенежныйПотокПослеОбъявленияОферты = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить новый денежный поток!");
			Возврат;
		КонецЕсли;
			
		
		// 0. определим поток на вчера, пока еще не была объявлана оферта
		
		ДенежныйПотокДоОбъявленияОферты = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
			Объект.Организация,
			Объект.Клиент,
			Объект.ЦеннаяБумага,
			Объект.Дата,
			Новый Структура("УчитыватьРешенияКлиентовПоПотокам, Партия, СтрокаПартии", Истина, СтрокаТаблицаПартий.Партия, СтрокаТаблицаПартий.СтрокаПартии),
			УчетныйАктивЕПС,
			,
			,
			НачалоДня(Объект.Дата) - 1,
			СтрокаТаблицаПартий.СчетДоверительногоУправления);
			
		//если, вдруг, при взятии потока за вчера, попадет приход денег за сегодня (а он нам не нужен) - уберем	
		Пока ДенежныйПотокДоОбъявленияОферты.Количество() > 1 // но важно при этом не удалить поток по номиналу, а то вообще ничего не останется 
			И НачалоДня(ДенежныйПотокДоОбъявленияОферты[0].ДатаПотока) = НачалоДня(Объект.Дата)
			И НЕ ПересчетВДеньОферты Цикл // купон в день оферты "виртуальный" - его не платят и не гасят, поэтому он идет в расчет АС
		
			ДенежныйПотокДоОбъявленияОферты.Удалить(0);
		
		КонецЦикла;

		
		// 1. считаем АС исходя из старой ЭСП и денежного потока ДО объявления оферты
		
		НастройкиУчетаЦеннойБумаги	= БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
			НастройкиУчетаОбщие,
			Объект.ЦеннаяБумага,
			УчетныйАктивЕПС,
			СтрокаТаблицаПартий.Партия,
			СтрокаТаблицаПартий.СтрокаПартии);
	
		СтоимостьПоЭСП = 0;
		ДенежныйПотокДоОбъявленияОферты.Колонки.Добавить("РазностьДат", Новый ОписаниеТипов("Число"));
		Для каждого СтрокаДенежныйПоток Из ДенежныйПотокДоОбъявленияОферты Цикл
			СтрокаДенежныйПоток.РазностьДат = (НачалоДня(СтрокаДенежныйПоток.ДатаПотока) - НачалоДня(Объект.Дата)) / 86400;
			СтоимостьПоЭСП = СтоимостьПоЭСП + СтрокаДенежныйПоток.СуммаПотока / Pow(1 + СтрокаТаблицаПартий.ЭСП / 100, СтрокаДенежныйПоток.РазностьДат / 365);
		КонецЦикла;
		Если НастройкиУчетаЦеннойБумаги.РазрядностьОкругленияАС <> 0 Тогда
			СтоимостьПоЭСП = Окр(СтоимостьПоЭСП, НастройкиУчетаЦеннойБумаги.РазрядностьОкругленияАС);
		КонецЕсли;
		
		
		// 2. берем АС из п.1 за цену покупки и считаем новую ЭСП и денежного потока ПОСЛЕ объявления оферты
		
		НоваяЭСП = БухгалтерскийУчет.РассчитатьДоходностьИДюрациюПоПотоку(ДенежныйПотокПослеОбъявленияОферты, НачалоДня(Объект.Дата), -СтоимостьПоЭСП, Точность).Доходность;
		Если НастройкиУчетаЦеннойБумаги.РазрядностьОкругленияЭСП <> 0 Тогда
			НоваяЭСП = Окр(НоваяЭСП, НастройкиУчетаЦеннойБумаги.РазрядностьОкругленияЭСП);
		КонецЕсли;
		СтрокаТаблицаПартий.ЭСП = НоваяЭСП;
		
	КонецЦикла;
	
	Объект.ЭСП.Загрузить(ТаблицаПартий);
	
	Для каждого СтрокаЭСП Из Объект.ЭСП Цикл
		СтрокаЭСП.Используется = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭСППриПоявленииДосрочнойОферты(Команда)

	Если Не ДоступноИзменениеСведенийПоЦеннойБумаге() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЭСППриПоявленииДосрочнойОфертыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьНастройкуИзЭСП(Команда)

	Если Не ДоступноИзменениеСведенийПоЦеннойБумаге() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ОткрытьФормуМодально("Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Форма.ФормаВводаНастройки");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Объект.НастройкиУчета.Очистить();
		
		Для каждого СтрокаЭСП Из Объект.ЭСП Цикл
		
			СтрокаНастройки = Объект.НастройкиУчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНастройки, СтрокаЭСП, "УчетныйАктивЕПС, Партия, СтрокаПартии");
			ЗаполнитьЗначенияСвойств(СтрокаНастройки, ДанныеЗаполнения, "Настройка, ЗначениеНастройки, Отключить");
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНастройкуИзВводаНаСервере(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И (СчетДоверительногоУправления.ДатаРасторжения >= &Период
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))) КАК КлиентыДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ВводЦенныхБумагЦенныеБумаги.Ссылка КАК Партия,
		|	ВводЦенныхБумагЦенныеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	&Настройка КАК Настройка,
		|	&ЗначениеНастройки КАК ЗначениеНастройки,
		|	&Отключить КАК Отключить
		|ИЗ
		|	Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВводЦенныхБумагЦенныеБумаги.Ссылка.Дата, ДЕНЬ) = &Период
		|	И ВводЦенныхБумагЦенныеБумаги.Ссылка.Организация = &Организация
		|	И ВводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|	И ВводЦенныхБумагЦенныеБумаги.Ссылка.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДУ.СчетДоверительногоУправления
		|			ИЗ
		|				_СчетаДУ)
		|	И ВводЦенныхБумагЦенныеБумаги.Ссылка.Проведен
		|	И НЕ ВводЦенныхБумагЦенныеБумаги.Ссылка.ПометкаУдаления
		|	И ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага = &ЦеннаяБумага";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	Запрос.УстановитьПараметр("Период", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ЦеннаяБумага", Объект.ЦеннаяБумага);

	Запрос.УстановитьПараметр("Настройка", ДанныеЗаполнения.Настройка);
	Запрос.УстановитьПараметр("ЗначениеНастройки", ДанныеЗаполнения.ЗначениеНастройки);
	Запрос.УстановитьПараметр("Отключить", ДанныеЗаполнения.Отключить);
	
	Объект.НастройкиУчета.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьНастройкуИзВвода(Команда)


	Если Не ДоступноИзменениеСведенийПоЦеннойБумаге() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ОткрытьФормуМодально("Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Форма.ФормаВводаНастройки");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		КомандаЗаполнитьНастройкуИзВводаНаСервере(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗначениеНастройкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Этаформа.Элементы.Настройки.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ДенежныйПотокПоОблигации") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура("Владелец", Объект.ЦеннаяБумага);
		ПараметрыФормы = Новый Структура("Отбор, Клиент, Дата", Отбор, Объект.Клиент, Объект.Дата);
		ФормаВыбора = ОткрытьФорму("Справочник.ДенежныеПотокиПоОблигациям.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗначениеНастройкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)

	ТекущиеДанные = Этаформа.Элементы.Настройки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ДенежныйПотокПоОблигации") Тогда
		
		Если Объект.ЦеннаяБумага = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Владелец") Тогда
			ТекущиеДанные.ЗначениеНастройки = ВыбранноеЗначение;	
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗначениеНастройкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Этаформа.Элементы.Настройки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ДенежныйПотокПоОблигации")
		И ТекущиеДанные.ЗначениеНастройки <> ПредопределенноеЗначение("Справочник.ДенежныеПотокиПоОблигациям.ПустаяСсылка") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура("Ключ, Клиент, Дата", ТекущиеДанные.ЗначениеНастройки, Объект.Клиент, Объект.Дата);
		
		ФормаОбъекта = ОткрытьФорму("Справочник.ДенежныеПотокиПоОблигациям.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьПоток(Команда)
	
	ТекущиеДанные = Этаформа.Элементы.Настройки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ДенежныйПотокПоОблигации")
		И ТекущиеДанные.ЗначениеНастройки <> ПредопределенноеЗначение("Справочник.ДенежныеПотокиПоОблигациям.ПустаяСсылка") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура("Ключ, Клиент, Дата", ТекущиеДанные.ЗначениеНастройки, Объект.Клиент, Объект.Дата);
		
		Если ТекущиеДанные.Партия <> Неопределено Тогда
			ПараметрыФормы.Вставить("Партия", ТекущиеДанные.Партия);
			ПараметрыФормы.Вставить("СтрокаПартии", ТекущиеДанные.СтрокаПартии);
		КонецЕсли;
		
		ФормаОбъекта = ОткрытьФорму("Справочник.ДенежныеПотокиПоОблигациям.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНастройкуПоКлиентуНаСервере(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	МАКСИМУМ(КлиентыДоверительногоУправления.Период) КАК Период
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|ГДЕ
		|	КлиентыДоверительногоУправления.Организация = &Организация
		|	И КлиентыДоверительногоУправления.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Период = ВыборкаДетальныеЗаписи.Период;
	Иначе
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И (СчетДоверительногоУправления.ДатаРасторжения >= &Период
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))) КАК КлиентыДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	&Настройка КАК Настройка,
		|	&ЗначениеНастройки КАК ЗначениеНастройки,
		|	&Отключить КАК Отключить
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ПериодОстатков,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И Организация = &Организация
		|				И ЦеннаяБумага = &ЦеннаяБумага
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ)) КАК БухПартииЦенныхБумагОстатки";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ПериодОстатков", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ЦеннаяБумага", Объект.ЦеннаяБумага);

	Запрос.УстановитьПараметр("Настройка", ДанныеЗаполнения.Настройка);
	Запрос.УстановитьПараметр("ЗначениеНастройки", ДанныеЗаполнения.ЗначениеНастройки);
	Запрос.УстановитьПараметр("Отключить", ДанныеЗаполнения.Отключить);
	
	Объект.НастройкиУчета.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьНастройкуПоКлиенту(Команда)
	
	Если Не ДоступноИзменениеСведенийПоЦеннойБумаге() Тогда
		Возврат;
	КонецЕсли;

	ДанныеЗаполнения = ОткрытьФормуМодально("Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Форма.ФормаВводаНастройки");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		КомандаЗаполнитьНастройкуПоКлиентуНаСервере(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаНастройки Тогда
		ЗаполнитьСписокВозможныхУчетныхАктивовЕПС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьРасчетнойЭСП(Команда)
	
	Если Не ДоступноИзменениеСведенийПоЦеннойБумаге() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЭСП(Истина, Неопределено, НачалоДня(Объект.Дата));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНастройкаПриИзменении(Элемент)
	
	НастройкиУчетныйАктивЕПСУстановитьРежимВыбораИзСписка(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастройкиУчетныйАктивЕПСУстановитьРежимВыбораИзСписка(Форма)
	
	Объект = Форма.Объект;
	
	НастройкиУчетныйАктивЕПСРежимВыбораИзСписка = Истина;
	
	Для Каждого НастройкаУчета Из Объект.НастройкиУчета Цикл
		
		Если НастройкаУчета.Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ИспользоватьЭтотУчетныйАктивПоУмолчанию") Тогда 
			НастройкиУчетныйАктивЕПСРежимВыбораИзСписка = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
	Форма.Элементы.НастройкиУчетныйАктивЕПС.РежимВыбораИзСписка = НастройкиУчетныйАктивЕПСРежимВыбораИзСписка;
	
КонецПроцедуры

#КонецОбласти
